/**
 *************************************************************************************************************************
 * @file    main.c
 * @brief   本示例演示了通过OLED显示和按键控制PAN3029/3060进行数据收发功能。
 * @version V1.0.1
 * @date    2025-08-18
 * @author  Panchip Team
 * @note    该示例功能描述如下：
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | 名称/功能        | 描述                                         | 设置方法                                         |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | PW               | 发射功率，1-22 档位                          | 按下 KEY1 保持，单击 KEY6 进行切换               |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | Mode             | A: 单包发送                                  | TX 模式下，单击 KEY4 进行切换                    |
 * |                  | B: 连续发送 100 包                           |                                                  |
 * |                  | C: 连续发送 9999 包                          |                                                  |
 * |                  | D: 进入单载波测试模式                        |                                                  |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | CR               | 编码率支持 CR4/5、CR4/6、CR4/7、CR4/8        | 按下 KEY1 保持，单击 KEY4 进行切换               |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | FQ               | 工作频点                                     | 按下 KEY1 保持，单击 KEY3 进行切换               |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | BW               | 信道带宽支持 500KHz、250KHz、125KHz、62.5KHz | 单击 KEY6 进行切换                               |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | SF               | 扩频因子，支持 5/6/7/8/9/10/11/12            | 单击 KEY5 进行切换                               |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | PL               | 发送数据长度，10-240 字节，10 字节/步进      | 按下 KEY1 保持，单击 KEY5 进行切换               |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | 发送数据         | 开始发送数据包                               | 单击 KEY3 即可按照 Mode 进行发送                 |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | 清除收发包计数   | 清除 TX 或 RX 的收发包计数                   | 单击 KEY2                                        |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * | 收发切换         | 设备进行 TX 和 RX 模式切换                   | 通过拨码开关切换，每次切换后需按下 KEY7 复位     |
 * |------------------|----------------------------------------------|--------------------------------------------------|
 * Copyright (C) 2025 Panchip Technology Corp. All rights reserved.
 **************************************************************************************************************************
 */

#include "pan_rf.h"
#include "oled.h"
#include "display.h"
#include "key_handle.h"

/**
  * @brief  The application entry point.
  * @retval int
  */
int32_t main(void)
{
    int ret = 0;

    BSP_ClockInit();        /* 初始化系统时钟 */
    BSP_SystickInit(1000u); /* 初始化SysTick定时器，1ms */
    BSP_GpioInit();         /* 初始化GPIO */
    BSP_UartInit();         /* 初始化UART */
    BSP_RFBusInit();        /* 初始化SPI/I2C */

    OLED_Init();            /* 初始化OLED显示 */
    KEY_Init();             /* 初始化按键 */
    
    ret = RF_Init();
    if(ret != RF_OK)
    {
        printf("RF init fail.\r\n");
        UI_ShowError("RF Init Fail");
        while(1);
    }

    printf("RF init ok\r\n");

    RF_ConfigUserParams(); /* 配置 Frequency、SF、BW、Preamble、CRC等参数 */

    UI_Init(); /* OLED菜单初始化 */
    
    if (g_UserTxMode)
    {
        printf("Enter tx mode\r\n");
    }
    else
    {
        printf("Enter rx mode\r\n");
        RF_EnterContinousRxState();
    }
    
    while (1)
    {
        RF_Process();
        KEY_Process();
    }
}
